package com.pratilipi.data.mock;

import java.util.Date;
import java.util.LinkedList;
import java.util.List;

import com.pratilipi.common.type.Language;
import com.pratilipi.data.type.Event;
import com.pratilipi.data.type.gae.EventEntity;

public class EventMock {

	public static final List<Event> EVENT_TABLE = new LinkedList<>();

	public static final Event hiEvent_1 = new EventEntity( 1L );
	public static final Event guEvent_1 = new EventEntity( 2L );
	public static final Event taEvent_1 = new EventEntity( 3L );

	
	static {
		EVENT_TABLE.add( hiEvent_1 );
		EVENT_TABLE.add( guEvent_1 );
		EVENT_TABLE.add( taEvent_1 );

		hiEvent_1.setName( "हिंदी" );
		hiEvent_1.setNameEn( "Hindi" );
		hiEvent_1.setLanguage( Language.HINDI );
		hiEvent_1.setDescription( "<h2>एक पल का क्रोध आपका भविष्य बिगाड सकता है ।</h2><br/><br/><i>एक पल का क्रोध आपका भविष्य बिगाड सकता है ।</i> एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है ।<br/><br/> एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है ।" );
		hiEvent_1.setCreationDate( new Date() );
		
		guEvent_1.setName( "ગુજરાતી" );
		guEvent_1.setNameEn( "Gujarati" );
		guEvent_1.setLanguage( Language.GUJARATI );
		guEvent_1.setDescription( "<b>એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો.</b> <i>એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો.</i>" );
		guEvent_1.setCreationDate( new Date() );

		taEvent_1.setName( "தமிழ்" );
		taEvent_1.setNameEn( "Tamil" );
		taEvent_1.setLanguage( Language.TAMIL );
		taEvent_1.setDescription( "<b>ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும்.</b> <i>ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும்.</i><br/><br/><b>ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும்.</b> <i>ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும்.</i><br/><br/><b>ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும்.</b> <i>ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும்.</i><br/><br/><b>ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும்.</b> <i>ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும்.</i>" );
		taEvent_1.setCreationDate( new Date() );
	}
	
}