package com.pratilipi.data.mock;

import static com.pratilipi.data.mock.AuthorMock.*;

import java.util.Date;
import java.util.LinkedList;
import java.util.List;

import com.pratilipi.common.type.Language;
import com.pratilipi.common.type.PratilipiContentType;
import com.pratilipi.common.type.PratilipiState;
import com.pratilipi.common.type.PratilipiType;
import com.pratilipi.data.type.Pratilipi;
import com.pratilipi.data.type.gae.PratilipiEntity;

public class PratilipiMock {

	public static final List<Pratilipi> PRATILIPI_TABLE = new LinkedList<>();

	public static final Pratilipi hiPratilipi_1 = new PratilipiEntity( 1L );
	public static final Pratilipi hiPratilipi_2 = new PratilipiEntity( 2L );
	public static final Pratilipi hiPratilipi_3 = new PratilipiEntity( 3L );

	public static final Pratilipi guPratilipi_1 = new PratilipiEntity( 4L );
	public static final Pratilipi guPratilipi_2 = new PratilipiEntity( 5L );
	public static final Pratilipi guPratilipi_3 = new PratilipiEntity( 6L );
	
	public static final Pratilipi taPratilipi_1 = new PratilipiEntity( 7L );
	public static final Pratilipi taPratilipi_2 = new PratilipiEntity( 8L );
	public static final Pratilipi taPratilipi_3 = new PratilipiEntity( 9L );

	
	static {
		PRATILIPI_TABLE.add( hiPratilipi_1 );
		PRATILIPI_TABLE.add( hiPratilipi_2 );
		PRATILIPI_TABLE.add( hiPratilipi_3 );
		
		PRATILIPI_TABLE.add( guPratilipi_1 );
		PRATILIPI_TABLE.add( guPratilipi_2 );
		PRATILIPI_TABLE.add( guPratilipi_3 );
		
		PRATILIPI_TABLE.add( taPratilipi_1 );
		PRATILIPI_TABLE.add( taPratilipi_2 );
		PRATILIPI_TABLE.add( taPratilipi_3 );

		hiPratilipi_1.setTitle( "बुक टाइटल १" );
		hiPratilipi_1.setTitleEn( "Book Title 1" );
		hiPratilipi_1.setLanguage( Language.HINDI );
		hiPratilipi_1.setAuthorId( hiAuthor_1.getId() );
		hiPratilipi_1.setSummary( "<b>एक पल का क्रोध आपका भविष्य बिगाड सकता है ।</b> <i>एक पल का क्रोध आपका भविष्य बिगाड सकता है ।</i> एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है ।" );
		hiPratilipi_1.setType( PratilipiType.BOOK );
		hiPratilipi_1.setReviewCount( 10L );
		hiPratilipi_1.setRatingCount( 10L );
		hiPratilipi_1.setTotalRating( 35L );
		hiPratilipi_1.setPageCount( 10 );
		hiPratilipi_1.setReadCount( 2046624124L );
		hiPratilipi_1.setFbLikeShareCount( 128L );
		hiPratilipi_1.setContentType( PratilipiContentType.PRATILIPI );
		hiPratilipi_1.setListingDate( new Date() );
		hiPratilipi_1.setState( PratilipiState.PUBLISHED );

		hiPratilipi_2.setTitle( "बुक टाइटल २" );
		hiPratilipi_2.setTitleEn( "Book Title 2" );
		hiPratilipi_2.setLanguage( Language.HINDI );
		hiPratilipi_2.setAuthorId( hiAuthor_1.getId() );
		hiPratilipi_2.setSummary( "एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है ।" );
		hiPratilipi_2.setType( PratilipiType.STORY );
		hiPratilipi_2.setReviewCount( 10L );
		hiPratilipi_2.setRatingCount( 10L );
		hiPratilipi_2.setTotalRating( 35L );
		hiPratilipi_2.setPageCount( 10 );
		hiPratilipi_2.setReadCount( 2046624124L );
		hiPratilipi_2.setFbLikeShareCount( 128L );
		hiPratilipi_2.setContentType( PratilipiContentType.PRATILIPI );
		hiPratilipi_2.setListingDate( new Date() );
		hiPratilipi_2.setState( PratilipiState.PUBLISHED );

		hiPratilipi_3.setTitle( "बुक टाइटल ३" );
		hiPratilipi_3.setTitleEn( "Book Title 3" );
		hiPratilipi_3.setLanguage( Language.HINDI );
		hiPratilipi_3.setAuthorId( hiAuthor_1.getId() );
		hiPratilipi_3.setSummary( "एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है । एक पल का क्रोध आपका भविष्य बिगाड सकता है ।" );
		hiPratilipi_3.setType( PratilipiType.POEM );
		hiPratilipi_3.setReviewCount( 10L );
		hiPratilipi_3.setRatingCount( 10L );
		hiPratilipi_3.setTotalRating( 35L );
		hiPratilipi_3.setPageCount( 10 );
		hiPratilipi_3.setReadCount( 2046624124L );
		hiPratilipi_3.setFbLikeShareCount( 128L );
		hiPratilipi_3.setContentType( PratilipiContentType.PRATILIPI );
		hiPratilipi_3.setListingDate( new Date() );
		hiPratilipi_3.setState( PratilipiState.PUBLISHED );

		guPratilipi_1.setTitle( "બૂક તીટલે 1" );
		guPratilipi_1.setTitleEn( "Book Title 1" );
		guPratilipi_1.setLanguage( Language.GUJARATI );
		guPratilipi_1.setAuthorId( guAuthor_1.getId() );
		guPratilipi_1.setSummary( "એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો." );
		guPratilipi_1.setType( PratilipiType.BOOK );
		guPratilipi_1.setReviewCount( 10L );
		guPratilipi_1.setRatingCount( 10L );
		guPratilipi_1.setTotalRating( 35L );
		guPratilipi_1.setPageCount( 10 );
		guPratilipi_1.setReadCount( 2046624124L );
		guPratilipi_1.setFbLikeShareCount( 128L );
		guPratilipi_1.setContentType( PratilipiContentType.PRATILIPI );
		guPratilipi_1.setListingDate( new Date() );
		guPratilipi_1.setState( PratilipiState.PUBLISHED );
		
		guPratilipi_2.setTitle( "બૂક તીટલે 2" );
		guPratilipi_2.setTitleEn( "Book Title 2" );
		guPratilipi_2.setLanguage( Language.GUJARATI );
		guPratilipi_2.setAuthorId( guAuthor_1.getId() );
		guPratilipi_2.setSummary( "એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો." );
		guPratilipi_2.setType( PratilipiType.STORY );
		guPratilipi_2.setReviewCount( 10L );
		guPratilipi_2.setRatingCount( 10L );
		guPratilipi_2.setTotalRating( 35L );
		guPratilipi_2.setPageCount( 10 );
		guPratilipi_2.setReadCount( 2046624124L );
		guPratilipi_2.setFbLikeShareCount( 128L );
		guPratilipi_2.setContentType( PratilipiContentType.PRATILIPI );
		guPratilipi_2.setListingDate( new Date() );
		guPratilipi_2.setState( PratilipiState.PUBLISHED );
		
		guPratilipi_3.setTitle( "બૂક તીટલે 3" );
		guPratilipi_3.setTitleEn( "Book Title 3" );
		guPratilipi_3.setLanguage( Language.GUJARATI );
		guPratilipi_3.setAuthorId( guAuthor_1.getId() );
		guPratilipi_3.setSummary( "એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો. એક ક્ષણ રેજ તમારા ભવિષ્ય વિશે કરી શકો છો." );
		guPratilipi_3.setType( PratilipiType.POEM );
		guPratilipi_3.setReviewCount( 10L );
		guPratilipi_3.setRatingCount( 10L );
		guPratilipi_3.setTotalRating( 35L );
		guPratilipi_3.setPageCount( 10 );
		guPratilipi_3.setReadCount( 2046624124L );
		guPratilipi_3.setFbLikeShareCount( 128L );
		guPratilipi_3.setContentType( PratilipiContentType.PRATILIPI );
		guPratilipi_3.setListingDate( new Date() );
		guPratilipi_3.setState( PratilipiState.PUBLISHED );
		
		taPratilipi_1.setTitle( "புக் டைட்டில் 1" );
		taPratilipi_1.setTitleEn( "Book Title 1" );
		taPratilipi_1.setLanguage( Language.TAMIL );
		taPratilipi_1.setAuthorId( taAuthor_1.getId() );
		taPratilipi_1.setSummary( "ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும் ." );
		taPratilipi_1.setType( PratilipiType.BOOK );
		taPratilipi_1.setReviewCount( 10L );
		taPratilipi_1.setRatingCount( 10L );
		taPratilipi_1.setTotalRating( 35L );
		taPratilipi_1.setPageCount( 10 );
		taPratilipi_1.setReadCount( 2046624124L );
		taPratilipi_1.setFbLikeShareCount( 128L );
		taPratilipi_1.setContentType( PratilipiContentType.PRATILIPI );
		taPratilipi_1.setListingDate( new Date() );
		taPratilipi_1.setState( PratilipiState.PUBLISHED );
		
		taPratilipi_2.setTitle( "புக் டைட்டில் 2" );
		taPratilipi_2.setTitleEn( "Book Title 2" );
		taPratilipi_2.setLanguage( Language.TAMIL );
		taPratilipi_2.setAuthorId( taAuthor_1.getId() );
		taPratilipi_2.setSummary( "ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும் ." );
		taPratilipi_2.setType( PratilipiType.STORY );
		taPratilipi_2.setReviewCount( 10L );
		taPratilipi_2.setRatingCount( 10L );
		taPratilipi_2.setTotalRating( 35L );
		taPratilipi_2.setPageCount( 10 );
		taPratilipi_2.setReadCount( 2046624124L );
		taPratilipi_2.setFbLikeShareCount( 128L );
		taPratilipi_2.setContentType( PratilipiContentType.PRATILIPI );
		taPratilipi_2.setListingDate( new Date() );
		taPratilipi_2.setState( PratilipiState.PUBLISHED );
		
		taPratilipi_3.setTitle( "புக் டைட்டில் 3" );
		taPratilipi_3.setTitleEn( "Book Title 3" );
		taPratilipi_3.setLanguage( Language.TAMIL );
		taPratilipi_3.setAuthorId( taAuthor_1.getId() );
		taPratilipi_3.setSummary( "ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும். ஒரு கணம் ஆத்திரம் உங்கள் எதிர்காலத்தை பற்றி என்ன செய்ய முடியும் ." );
		taPratilipi_3.setType( PratilipiType.POEM );
		taPratilipi_3.setReviewCount( 10L );
		taPratilipi_3.setRatingCount( 10L );
		taPratilipi_3.setTotalRating( 35L );
		taPratilipi_3.setPageCount( 10 );
		taPratilipi_3.setReadCount( 2046624124L );
		taPratilipi_3.setFbLikeShareCount( 128L );
		taPratilipi_3.setContentType( PratilipiContentType.PRATILIPI );
		taPratilipi_3.setListingDate( new Date() );
		taPratilipi_3.setState( PratilipiState.PUBLISHED );
	}
	
}