"കുഴിവെട്ടി മൂടുക വേദനകള്‍, കുതികൊള്‍ക ശക്തിയിലേക്കു നമ്മള്‍ " ## ഇടശ്ശേരി
"മനുഷ്യ മസ്തിഷ്കത്തോടല്ല, മാംസത്തോടല്ല, മനസ്സിനോടേ കാവ്യഹൃദയം സംസാരിക്കൂ " ## വയലാര്‍
വായിച്ചാലും വളരും വായിച്ചില്ലങ്കിലും വളരും. വായിച്ചാൽ വിളയും വായിച്ചില്ലെങ്കിൽ വളയും ## കുഞ്ഞുണ്ണിമാഷ്
"പണവും പ്രതാപവുമറ്റിടത്തും പ്രണയം മുളച്ചുകൂടായ്കയില്ല." ## ചങ്ങമ്പുഴ (രമണന്‍ )
"മറ്റുള്ള  ഭാഷകള്‍ കേവലം ധാത്രിമാര്‍ മര്‍ത്യന്നു പെറ്റമ്മ തന്‍ ഭാഷ താന്‍ " ## വള്ളത്തോള്‍
സ്വന്തം ബുദ്ധി ഉപയോഗിക്കാതെ മറ്റ് വല്ലവന്‍റെയും തല ഉപയോഗിച്ച് ചിന്തിക്കലാണ് വായന ## ആർതർ ഷോപ്പനോർ
വിശക്കുന്ന മനുഷ്യാ, പുസ്തകം കൈയിലെടുക്കൂ: അതൊരായുധമാണ്‌. ## ബെർതോൾഡ് ബ്രെഹ്ത്
പുസ്തകങ്ങൾ ഇല്ലാത്ത മുറി, ആത്മാവില്ലാത്ത ശരീരം പോലെയാണ്. ## ക്രിസ്റ്റ്ഫർ മോർളി
നല്ല പുസ്തകങ്ങൾ വായിക്കാത്ത ഒരുവനും ഒരു നിരക്ഷരനും തമ്മിൽ ഒരു വ്യത്യാസവുമില്ല. ## മാർക്ക് ട്വയ്ൻ
ജീവിതത്തെ വലിച്ചെറിയുക, അതിനെ വീണ്ടെടുക്കാൻ. ## ഫ്രാന്‍സ് കാഫ്‌ക
എഴുത്തുകാർ മരിച്ചു കഴിഞ്ഞാൽ പുസ്തകങ്ങളാകുന്നു. ## ലൂയി ബോർജ്ജേ
ശരീരത്തിനു വ്യായാമം പോലെയാണ് മനസ്സിനു വായന. ## ജോസഫ് അഡിസൺ
പുസ്തകം കടം കൊടുക്കുന്നവൻ വിഡ്ഢിയാണ്. മടക്കികൊടുക്കുന്നവനോ പമ്പര വിഡ്ഢിയും. ## അറബി പഴമൊഴി
അടച്ചുവച്ചിരിക്കുന്ന പുസ്തകം വെറുമൊരു ഇഷ്ടിക പോലെയാണ് ## ഇംഗ്ലീഷ്  പഴമൊഴി
മനുഷ്യരിലുള്ള  അന്തര്‍ലീനമായ പൂർണ്ണതയുടെ ആവിഷ്കാരമാണ് വിദ്യാഭ്യാസം ## സ്വാമി വിവേകാനന്ദന്‍
കാലവും ക്ഷമയും, ഇവരാണ് ഏറ്റവും ശക്തരായ രണ്ട് യോദ്ധാക്കള്‍ ## ലിയോ ടോള്‍സ്റ്റോയ്‌
ലോകത്തിന്റെ വെളിച്ചമാണ് പുസ്തകങ്ങൾ ## മഹാത്മാഗാന്ധി
മരണം രംഗബോധമില്ലാത്ത കോമാളിയാണ് ## എം ടി (മഞ്ഞ്)
സംഘടന കൊണ്ട് ശക്തരാകുക, വിദ്യ കൊണ്ട് പ്രബുദ്ധരാകുക ## ശ്രീ നാരായണ ഗുരു
പുറംചട്ട കണ്ട് ഒരു പുസ്തകത്തെ വിലയിരുത്തരുത്. ## ഇംഗ്ലീഷ്  പഴമൊഴി
നാം അനുഭവിക്കാത്ത ജീവിതങ്ങള്‍ എല്ലാം നമുക്ക് വെറും കെട്ടുകഥകള്‍ മാത്രമാണ് ## ബെന്യാമിന്‍ (ആടുജീവിതം )
ഒരു പുസ്തകം തുറക്കുന്നത് എപ്പോഴും ലാഭമുണ്ടാക്കുകയേയുള്ളൂ ## ചൈനീസ് പഴമൊഴി
"ഭാഷയുടെ വാതിലടയ്ക്കൂ,പ്രണയത്തിന്‍റെ ജനാല തുറക്കൂ." ## ജലാലുദീൻ റൂമി
ഖേദിക്കകൊണ്ടു ഫലമില്ല, നമുക്കതല്ല, മോദത്തിനും ഭുവി വിപത്തു വരാം ചിലപ്പോൾ ## കുമാരനാശാന്‍ (വീണപൂവ്)
"ഭോഗങ്ങളെല്ലാം ക്ഷണ പ്രഭാചഞ്ചലം,വേഗേനെ നഷ്ടമാം ആയുസുമോര്‍ക്ക നീ" ## തുഞ്ചത്തെഴുത്തച്ഛൻ(അധ്യാത്മരാമായണം )
